"""[TASK] #6 Quiz 1."""

# 1. Зачем нужна кнопка History и какие функции появляются при нажатии правой кнопкой мыши на коммит?
#
# Кнопка history позволяет увидеть историю предыдущих коммитов
# При нажатии правой кнопки мыши на коммит появляются следующие функции:
#
# Amend commit
# Undo commit
# Reset to commit
# Checkout commit
# Reorder commit
# Revert changes in commit
# Create branch from commit
# Create Tag
# Cherry-pick commit
# Copy SHA
# Copy tag
# View on GitHub
#
# 1.1. Где взять ссылку на коммит? Куда её отправлять?
#
# Ссылку можно взять из адресной строки браузера, открыв коммит на сайте GitHub
# Отправлять её нужно в группу в Телеграме
#
# 2. Что такое файл лога?
#
# log.ipynb используется чтобы отмечать какая работа была проделана и когда
#
# 2.1. Когда нужно его пушить?
#
# Только в самом начале при ознакомлении
#
# 3. Что такое интерпретатор?
#
# Программа которая обрабатывает инструкции одна за другой и отправляет их компьютеру для выполнения
#
# 4. Где можно выбрать интерпретатор?
#
# В меню VSCode нужно выбрать Python: Select Interpreter
#
# 5. Что такое модуль?
#
# Отдельный файл Python, функции и классы которого можно импортировать в другой
#
# 6. Как создать и отправить коммит?
#
# Во вкладке Source Control написать сообщение в поле Message и нажать кнопку Commit. Далее, нажать кнопку Commit & Push
#
# 7. Как убедиться, что коммит отправлен и находится на GitHub?
#
# Нажать правой кнопкой на коммит и перейти на веб версию (View on GitHub)
#
# 8. Какая команда показывает, что код не прошёл проверки на ошибки?
#
# pre-commit run --all-files
#
# 8.1. Перечислите линтеры, которые используются для проверки кода, и кратко охарактеризуйте каждый.
#
# jupytext - конвертирует Jupyter Notebook в текстовый формат и обратно
# docformatter - приводит строки документации к стандартному оформлению
# black - автоматически форматирует Python-код по единым правилам
# nbqa-black - форматирует код в Jupyter Notebook с помощью Black
# pyupgrade - заменяет устаревшие конструкции Python современными аналогами
# isort - упорядочивает импорты и распределяет их по группам
# nbqa-blacken-docs - форматирует фрагменты Python-кода в документации ноутбуков
# nbqa-pyupgrade - модернизирует синтаксис Python в Jupyter Notebook
# nbqa-isort - приводит порядок импортов в ноутбуках к единому стандарту
# codespell - обнаруживает опечатки в исходном коде и текстовой документации
# nbqa-flake8 - анализирует код ноутбуков на ошибки и несоответствия стилю
# flake8 - проверяет Python-код на типичные ошибки и нарушения стандартов оформления
# nbqa-mypy - анализирует корректность использования типов в Jupyter Notebook
# mypy - выявляет несоответствия типов посредством статической проверки
# nbqa-pylint - оценивает качество кода в ноутбуках и обнаруживает потенциальные проблемы
# pylint - анализирует код на ошибки, недостатки структуры и нарушения рекомендаций
# nbqa-pydocstyle - проверяет соблюдение правил оформления строк документации в ноутбуках
#
#
# 9. Как узнать, какой именно линтер не прошёл проверку?
#
# Напротив названия этого линтера появится надпись Failed с красным фоном
#
# 10. Видит ли линтер Pylint markdown?
#
# Нет, Pylint не анализирует Markdown. Он предназначен для статического анализа Python-кода (.py)
#
# 11. Могут ли номер ячейки в терминале и номер ячейки в VS Code отличаться? В каком случае?
#
# Да, они могут отличаться. Линтеры нумеруют только кодовые ячейки, хотя у нас могут быть ячейки Markdown
#
# 12. Где посмотреть номер ячейки в VS Code?
#
# На нижней панели справа, Cell ... of ...
#
# 13. В каком формате .ipynb отправляется на GitHub? При чём здесь JSON?
#
# Файл содержит JSON, где указывается тип и содержимое ячейки
#
# 14. Где посмотреть, в какой ячейке ошибка?
#
# Во вкладке Problems либо может быть указано при проверке линтером (то есть в терминале)
#
# 15. Как запустить терминал?
#
# Вверху нажать Terminal -> New Terminal
#
# 16. Что такое линтер?
#
# Программа или скрипт для проверки написанного кода
#
# 17. На какой сайт нужно вставлять код ошибки, если она связана с Pylint?
#
# https://pylint.readthedocs.io/en/stable/user_guide/messages/
#
# 18. Секция pydocstyle в большинстве случаев закрывается автоматически после исправления ошибок в каком линтере?
#
# pylint
#
# 19. Что такое описание модуля? Должно ли оно отражать содержимое модуля?
#
# module docstring, между тройными кавычками там объясняется значение и содержание модуля
#
# 20. С какой git-команды начинается утро программиста?
#
# git fetch, проверить есть ли изменения. git pull, чтобы скачать изменения
#
# 21. После внесения изменений в файлы кнопка «Open in Visual Studio Code» в GitHub Desktop пропадает. Как ещё можно открыть VS Code из GitHub Desktop?
#
# Нажать правой кнопкой по названию директории и там будет Open in Visual Studio Code
#
# ##### Stash
#
# 22. Что такое stash? Объясните концепцию в общих чертах.
#
# Буффер, в котором содержатся спрятанные изменения (не коммит), которые позволяют переключиться между ветками
#
# 22.1. Как сохранить изменения в stash?
#
# git-команда (подсказка):
#
# git stash push
#
# кнопка в VS Code:
#
# Git : Stash
#
# 22.2. Как восстановить stash (подсказка)?
#
# git-команда (подсказка):
#
# git stash apply stash@{n}
#
# где n - номер, полученный в списке git stash list
#
# git stash pop - позволяет восстановить последний стэш и убрать его из списка
#
# 22.3. Чем stash отличается от коммита? Когда лучше сохранить изменения в stash, а когда — закоммитить?
#
# Стэш не привязан к ветке и истории, это временное локальное хранилище (на удалённый репозиторий оно не отправляется), а коммит остаётся в истории ветки
#
# 22.4. Как просмотреть список сохранённых stash?
#
# git-команда (подсказка):
#
# git stash list
#
# 22.5. Как удалить stash? Приведите команды для удаления отдельной записи и всех сразу.
#
# git-команда (подсказка):
#
# git stash drop stash@{n} - удаление одного конкретного, где n это номер
#
# git stash clear - удаление всех
#
# 22.6. Приведите практические примеры использования stash — краткие сценарии, где он помогает.
#
# На практике стэш позволяет вернуться к недоделанным изменениям позже, без необходимости делать Commit Amend.
# Также удобно позволяет переходить между ветками, если мы пока не решились делать коммит.
#
# ##### Конфликты
#
# 23. Где увидеть, что в файлах есть конфликт?
#
# VSCode - Source Control
# GitHub Desktop также предупреждает о Merge Conflicts
#
# 23.1. Когда он возникает?
#
# Когда невозможно автоматически сделать слияние двух файлов. Обычно так происходит когда кто-то уже внёс изменения.
#
# 24. Как разрешить конфликт в файлах?
#
# Открыть VSCode и выбрать между:
#
# Accept Current Change
# Accept Incoming Change
# Accept Both Changes
# Resolve in Merge Editor
#
# 25. Выберите правильное утверждение:
#
# а) зелёное — то, что пришло с GitHub, синее — локальные изменения;
# б) синее — то, что пришло с GitHub, зелёное — локальные изменения.
#
# Верное утверждение а)
# Current change (зеленое) - мои текущие локальные изменения (HEAD)
# Incoming change (синее) - изменения которые приходят из GitHub (удаленной ветки)
#
# 26. Если мы работаем в одном файле, можно ли принять pull после того, как спрятали свои изменения в stash?
#
# Да, stash не будет мешать
#
# 26.1. Что может произойти, если восстановить stash после принятия pull?
#
# Зависит от того, какой код менялся. Если менялись одни и те же участки кода удаленно и локально, то появится конфликт
#
# 27. Сколько способов разрешения конфликтов показано в видео? Укажите число и перечислите способы.
#
# 4
# Принять удаленные изменения
# Принять локальные изменения
# Принять оба изменения
# Изменить вручную
#
# 28. Что делает кнопка Complete Merge?
#
# Делает слияние и специальный коммит об этом
#
# ##### Общие вопросы
#
# 29. В какой чат писать, если остались вопросы?
#
# Help Me
#
# https://t.me/c/1937296927/2415
#
# 30. Что такое fork? Зачем его делают?
#
# Это копия репозитория (чужого) которую мы сохраняем в свой аккаунт.
#
# 31. Как скачать форкнутый репозиторий на локальный компьютер?
#
# Clone repository через GitHub Desktop
#
# 32. С какой вероятностью ваши ошибки уже были кем-то решены? И кем?
#
# С большой вероятностью решены другими участниками, разрабами или коммьюнити в целом
#
# 33. Как создать файл в VS Code?
#
# File -> New File
#
# 34. Нужно ли заполнять файл лога в конце каждого урока?
#
# Нет
#
# ==================
#
# #### Дополнительные вопросы
#
# 1. Какая команда конвертирует файл из .ipynb в .py? (подсказка)
#
# jupyter nbconvert --to python
#
# 2. Что такое пакетный менеджер? Каким вы пользуетесь — conda или pip? Какой лучше использовать в data science?
#
# Программа для удобного скачивания и контроля библиотек
# Я пользуюсь и тем, и тем
# Но лучше Conda, там больше библиотек для наших целей
#
# 3. Почему расширение .py лучше, чем .ipynb?
#
# Проще просмотр на GitHub, ведь JSON (ipynb) не так удобен
#
# 4. Что такое PEP 8? (подсказка)
#
# Руководство по стилю от создателей языка
#
# 4.1. Проверяют ли линтеры соблюдение PEP 8?
#
# Некоторые, например Flake8 или Pylint
#
# 4.2. Какая нотация используется для именования переменных? (ответ на стр. 85–95: https://t.me/c/1937296927/1/16676)
#
# Змеиный регистр (snake_case)
#
# 4.3. Может ли имя переменной состоять из одного символа, например из подчёркивания _?
#
# Да
#
# 4.4. Зачем и где используется подчёркивание _?
#
# Она часто используется как ненужная переменная
# В змеином регистре позволяет разделять название на логические единицы
#
# 4.5. Допустимо ли по PEP 8 имя переменной из одной буквы? (ответ на стр. 85–95: https://t.me/c/1937296927/1/16676)
#
# Да, но нежелательно использовать l , L , O, I потому что они выглядят как 1 и 0
#
