"""[TASK] virtual-environment."""

# ### Создание и активация окружения
#
# 1. Что делает команда python -m venv venv?
#
# Создаёт виртуальное окружение с названием "venv"
#
# 2. Что делает каждая команда в списке ниже?
#
# pip list  -> показывает установленные пакеты
#
# pip freeze > requirements.txt -> сохраняет список зависимостей с их
# версиями в текстовый файл с названием requirements
#
# pip install -r requirements.txt -> устанавливает зависимости
# согласно версиям
#
# 3. Что делает каждая команда в списке ниже?
#
# conda env list -> показывает список окружений
#
# conda create -n env_name python=3.5 -> создает окружение с Python
# версии 3.5
#
# conda env update -n env_name -f file.yml -> обновляет окружение на
# основании файла file.yml
#
# source activate env_name -> включение окружения
#
# source deactivate -> выключение окружения
#
# conda clean -a -> очистка кэша
#
# Пояснение: Команды source activate и source deactivate
# использовались в старых версиях Conda. Начиная с Conda 4.4
# рекомендуется использовать conda activate env_name и conda
# deactivate.
#
# 4. Активируйте в терминале сначала окружение venv, затем окружение
# conda с названием SENATOROV. Вставьте скриншот терминала.
#
# (На скриншоте показано активированное окружение venv, его
# отключение, и включение окружения Conda c названием SENATOROV)
# ![image.png](attachment:image.png)
#
# 5. Как установить пакеты внутрь виртуального окружения venv и conda?
#
# В venv установка выполняется через pip:
# source venv/bin/activate
# python -m pip install numpy pandas matplotlib
#
# Conda:
# conda activate SENATOROV
# conda install numpy pandas matplotlib
#
#
# 6. Что делают эти команды?
#
# Обе команды сохраняют зависимости текущего окружения, первая делает
# это для pip, другая для conda
#
# pip freeze > requirements.txt
# conda env export > environment.yml
#
# 7. Вставьте скриншот, на котором видны папка venv в вашем
# репозитории и файлы зависимостей requirements.txt и environment.yml.
# Файлы должны содержать список зависимостей.
#
# (На скриншоте показаны списки установленных пакетов requirements.txt
# и environment.yml, а также панель Explorer в VS Code где видны эти
# файлы и папка venv. Данные файлы не включены в commit поскольку это
# не требуется по заданию)
# ![image-2.png](attachment:image-2.png)
#
# 8. Что делают эти команды?
#
# pip install -r requirements.txt -> Читает файл requirements.txt и
# устанавливает перечисленные Python-библиотеки, указанные версии
#
# conda env create -f environment.yml -> Создаёт новое окружение Conda
# по конфигурации, записанной в YAML-файле
#
# 9. Что делают эти команды?
#
# pip list  -> Выводит таблицу установленных Python-пакетов и их
# версий в текущем окружении
#
# pip show <название_пакета> -> Показывает подробную информацию об
# определённом пакете: версию, описание, расположение на диске и
# зависимости
#
# conda list -> Отображает пакеты, установленные в текущем окружении
# Conda, включая их версии, сборки и каналы установки
#
# 10. Где по умолчанию больше пакетов — в venv/pip или в conda? Почему
# data scientists используют conda?
#
# В стандартном виртуальном окружении venv обычно установлен
# минимальный набор инструментов Python, а дополнительные библиотеки
# устанавливаются через pip. В Conda количество предустановленных
# пакетов зависит от типа окружения: базовое окружение Anaconda обычно
# содержит больше библиотек, тогда как новое окружение Miniconda может
# быть практически пустым.
# Conda особенно удобна для Data Science и Machine Learning, ведь она
# позволяет устанавливать не только Python-пакеты, но и системные
# библиотеки, упрощает управление версиями Python и зависимостями
#
# 11. Выберите интерпретатор Python из окружения conda в VS Code или
# Cursor. Вставьте скриншот, на котором это видно.
#
# (На скриншотах показано правильно выбранный интерпретатор из
# окружения conda)
#
# ![image-3.png](attachment:image-3.png)
#
# ![image-4.png](attachment:image-4.png)
#
# 12. Добавьте папку SENATOROV в файл .gitignore.
#
# Сделано, теперь Git будет игнорировать папки с названием SENATOROV.
# Данное изменение можно проверить в измененных файлах в commit.
#
# 13. Зачем нужно виртуальное окружение?
#
# Виртуальное окружение позволяет изолировать библиотеки и их версии
# для каждого Python-проекта. Виртуальные окружения решают эту
# проблему: каждый проект получает собственный набор зависимостей.
#
# 14. Вы научились выгружать зависимости и работать с окружением?
#
# Да.
#
# 15. Удалите папку venv — она больше не нужна. Для задач data science
# достаточно conda.
#
# Удалил.

#
